import React from 'react';

export const Salute11Icon: React.FC<React.SVGProps<SVGSVGElement>> = (props) => (
    <svg id="Livello_2" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 100 100" {...props}>
        <g id="Livello_1-2">
            <g id="_Ñëîé_12">
                <circle cx="50" cy="50" r="50" style={{ fill: '#10aac3' }} />
                <path d="M80.94,63.26c.49-.49.49-1.28,0-1.77-5.86-5.86-11.59-4.31-17.15-2.12,2.04-5.76,2.9-12.12-4.07-19.1-6.97-6.97-13.33-6.11-19.1-4.07,2.19-5.56,3.74-11.29-2.12-17.14-.49-.49-1.28-.49-1.77,0L.31,55.5s0,0,0,0c2.54,23.22,20.97,41.65,44.19,44.19l36.44-36.43Z" style={{ isolation: 'isolate', opacity: 0.3 }} />
                <rect x="17.61" y="29.49" width="25" height="1.25" transform="translate(-12.47 30.11) rotate(-45)" style={{ fill: '#ef4836' }} />
                <rect x="21.07" y="31.69" width="22.5" height="1.25" transform="translate(-13.39 32.32) rotate(-45)" style={{ fill: '#f39c12' }} />
                <rect x="24.53" y="33.91" width="20" height="1.25" transform="translate(-14.3 34.53) rotate(-45)" style={{ fill: '#2fcc58' }} />
                <rect x="30.49" y="36.12" width="12.5" height="1.25" transform="translate(-15.22 36.74) rotate(-45)" style={{ fill: '#ef4836' }} />
                <rect x="33.65" y="40.55" width="15" height="1.25" transform="translate(-17.06 41.15) rotate(-44.99)" style={{ fill: '#f39c12' }} />
                <rect x="33.38" y="42.76" width="20" height="1.25" transform="translate(-17.97 43.38) rotate(-45)" style={{ fill: '#2fcc58' }} />
                <rect x="34.33" y="44.95" width="22.5" height="1.25" transform="translate(-18.87 45.58) rotate(-45)" style={{ fill: '#ef4836' }} />
                <rect x="35.28" y="47.18" width="25" height="1.25" transform="translate(-19.81 47.79) rotate(-45)" style={{ fill: '#f39c12' }} />
                <polygon points="59.28 41.6 41.6 59.28 40.72 58.39 58.4 40.72 59.28 41.6" style={{ fill: '#2fcc58' }} />
                <rect x="39.7" y="51.6" width="25" height="1.25" transform="translate(-21.64 52.2) rotate(-45)" style={{ fill: '#ef4836' }} />
                <rect x="43.16" y="53.8" width="22.5" height="1.25" transform="translate(-22.55 54.42) rotate(-45)" style={{ fill: '#f39c12' }} />
                <rect x="46.62" y="56.01" width="20" height="1.25" transform="translate(-23.46 56.62) rotate(-45)" style={{ fill: '#2fcc58' }} />
                <rect x="51.34" y="58.21" width="15" height="1.25" transform="translate(-24.37 58.84) rotate(-45)" style={{ fill: '#ef4836' }} />
                <rect x="58.26" y="62.63" width="10" height="1.25" transform="translate(-26.2 63.26) rotate(-45)" style={{ fill: '#f39c12' }} />
                <rect x="55.46" y="64.84" width="20" height="1.25" transform="translate(-27.12 65.47) rotate(-45)" style={{ fill: '#2fcc58' }} />
                <rect x="56.42" y="67.05" width="22.5" height="1.25" transform="translate(-28.03 67.68) rotate(-45)" style={{ fill: '#ef4836' }} />
                <rect x="57.39" y="69.24" width="25" height="1.25" transform="translate(-28.93 69.89) rotate(-45)" style={{ fill: '#f39c12' }} />
                <path d="M63.26,80.93h0c-.49.49-1.28.49-1.77,0-6.47-6.47-3.9-12.79-1.42-18.89,2.66-6.53,5.17-12.71-2.12-20-7.29-7.29-13.46-4.78-20-2.12-6.1,2.48-12.42,5.06-18.89-1.42-.49-.49-.49-1.28,0-1.77.49-.49,1.28-.49,1.77,0,5.3,5.3,10.34,3.25,16.18.87,6.68-2.72,14.25-5.8,22.71,2.67,8.46,8.46,5.38,16.03,2.67,22.71-2.38,5.84-4.43,10.88.87,16.18.49.49.49,1.28,0,1.77Z" style={{ fill: '#eee' }} />
                <path d="M80.94,63.26h0c.49-.49.49-1.28,0-1.77-6.48-6.48-12.79-3.9-18.89-1.42-6.53,2.66-12.71,5.17-20-2.12-7.29-7.29-4.78-13.46-2.12-20,2.49-6.11,5.05-12.42-1.42-18.89-.49-.49-1.28-.49-1.77,0-.49.49-.49,1.28,0,1.77,5.3,5.3,3.25,10.34.87,16.18-2.72,6.68-5.8,14.25,2.67,22.71,8.47,8.46,16.03,5.38,22.71,2.67,5.84-2.38,10.88-4.43,16.18.87.49.49,1.28.49,1.77,0Z" style={{ fill: '#eee' }} />
                <path d="M59.72,40.28c-6.97-6.97-13.33-6.11-19.1-4.07,2.19-5.56,3.74-11.29-2.12-17.15-.49-.49-1.28-.49-1.77,0-.49.49-.49,1.28,0,1.77.31.31.58.61.85.92l-7.92,7.92.88.88,7.8-7.8c.39.57.7,1.14.95,1.71l-7.42,7.42.88.88,7.01-7.01c.21.79.29,1.57.29,2.36l-5.97,5.97.88.88,5.97-5.97c.79,0,1.57.08,2.36.29l-7,7.01.88.88,7.42-7.42c.57.25,1.14.55,1.71.95l-7.8,7.8.88.88,7.92-7.92c.31.26.61.54.92.85.49.49,1.28.49,1.77,0,.49-.49.49-1.28,0-1.77-5.86-5.86-11.58-4.31-17.14-2.12,2.03-5.76,2.9-12.13-4.07-19.1Z" style={{ isolation: 'isolate', opacity: 0.1 }} />
            </g>
        </g>
    </svg>
);
